In [70]:
#================================================
# DATA
#================================================

import duckdb, pandas as pd
from pathlib import Path
import matplotlib.pyplot as plt
import numpy as np

# cria ou liga se já existir:
con = duckdb.connect("movielens100K.duckdb")

In [46]:
IMDB_DIR = Path("..") / "data" / "Imdb"
IMDB_DIR

WindowsPath('../data/Imdb')

### Análise ficheiro 1: "name.basics.tsv"

In [47]:
con.sql(f"""
CREATE OR REPLACE TABLE imdb_name_basics AS
SELECT *
FROM read_csv_auto('{IMDB_DIR / "name.basics.tsv"}', delim='\t', header=TRUE)
""")

FloatProgress(value=0.0, layout=Layout(width='auto'), style=ProgressStyle(bar_color='black'))

In [48]:
con.sql("PRAGMA table_info('imdb_name_basics')").df()

   cid               name     type  notnull dflt_value     pk
0    0             nconst  VARCHAR    False       None  False
1    1        primaryName  VARCHAR    False       None  False
2    2          birthYear  VARCHAR    False       None  False
3    3          deathYear  VARCHAR    False       None  False
4    4  primaryProfession  VARCHAR    False       None  False
5    5     knownForTitles  VARCHAR    False       None  False

In [49]:
con.sql("SELECT * FROM imdb_name_basics LIMIT 10").df()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"actor,miscellaneous,producer","tt0072308,tt0050419,tt0027125,tt0025164"
1,nm0000002,Lauren Bacall,1924,2014,"actress,miscellaneous,soundtrack","tt0037382,tt0075213,tt0038355,tt0117057"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"
3,nm0000004,John Belushi,1949,1982,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050986,tt0069467,tt0083922,tt0050976"
5,nm0000006,Ingrid Bergman,1915,1982,"actress,producer,soundtrack","tt0034583,tt0038109,tt0036855,tt0038787"
6,nm0000007,Humphrey Bogart,1899,1957,"actor,producer,miscellaneous","tt0034583,tt0043265,tt0037382,tt0042593"
7,nm0000008,Marlon Brando,1924,2004,"actor,director,writer","tt0078788,tt0068646,tt0047296,tt0070849"
8,nm0000009,Richard Burton,1925,1984,"actor,producer,director","tt0061184,tt0087803,tt0057877,tt0059749"
9,nm0000010,James Cagney,1899,1986,"actor,director,producer","tt0029870,tt0031867,tt0042041,tt0034236"

### Análise ficheiro 2: "title.akas.tsv"

In [50]:
con.sql(f"""
CREATE OR REPLACE TABLE imdb_title_akas AS
SELECT *
FROM read_csv_auto('{IMDB_DIR / "title.akas.tsv"}', delim='\t', header=TRUE)
""")

FloatProgress(value=0.0, layout=Layout(width='auto'), style=ProgressStyle(bar_color='black'))

In [51]:
con.sql("PRAGMA table_info('imdb_title_akas')").df()

   cid             name     type  notnull dflt_value     pk
0    0          titleId  VARCHAR    False       None  False
1    1         ordering   BIGINT    False       None  False
2    2            title  VARCHAR    False       None  False
3    3           region  VARCHAR    False       None  False
4    4         language  VARCHAR    False       None  False
5    5            types  VARCHAR    False       None  False
6    6       attributes  VARCHAR    False       None  False
7    7  isOriginalTitle   BIGINT    False       None  False

In [52]:
con.sql("SELECT * FROM imdb_title_akas LIMIT 10").df()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Carmencita,\N,\N,original,\N,1
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita,US,\N,imdbDisplay,\N,0
3,tt0000001,4,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
4,tt0000001,5,Καρμενσίτα,GR,\N,imdbDisplay,\N,0
5,tt0000001,6,Карменсита,RU,\N,imdbDisplay,\N,0
6,tt0000001,7,Карменсіта,UA,\N,imdbDisplay,\N,0
7,tt0000001,8,カルメンチータ,JP,ja,imdbDisplay,\N,0
8,tt0000002,1,Le clown et ses chiens,\N,\N,original,\N,1
9,tt0000002,2,A bohóc és kutyái,HU,\N,imdbDisplay,\N,0

### Análise ficheiro 3: "title.basics.tsv"

In [53]:
con.sql(f"""
CREATE OR REPLACE TABLE imdb_title_basics AS
SELECT *
FROM read_csv_auto('{IMDB_DIR / "title.basics.tsv"}', delim='\t', header=TRUE)
""")

FloatProgress(value=0.0, layout=Layout(width='auto'), style=ProgressStyle(bar_color='black'))

In [54]:
con.sql("PRAGMA table_info('imdb_title_basics')").df()

   cid            name     type  notnull dflt_value     pk
0    0          tconst  VARCHAR    False       None  False
1    1       titleType  VARCHAR    False       None  False
2    2    primaryTitle  VARCHAR    False       None  False
3    3   originalTitle  VARCHAR    False       None  False
4    4         isAdult   BIGINT    False       None  False
5    5       startYear  VARCHAR    False       None  False
6    6         endYear  VARCHAR    False       None  False
7    7  runtimeMinutes  VARCHAR    False       None  False
8    8          genres  VARCHAR    False       None  False

In [55]:
con.sql("SELECT * FROM imdb_title_basics LIMIT 10").df()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Poor Pierrot,Pauvre Pierrot,0,1892,\N,5,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,Short
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,\N,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,\N,1,"Short,Sport"
7,tt0000008,short,Edison Kinetoscopic Record of a Sneeze,Edison Kinetoscopic Record of a Sneeze,0,1894,\N,1,"Documentary,Short"
8,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894,\N,45,Romance
9,tt0000010,short,Leaving the Factory,La sortie de l'usine Lumière à Lyon,0,1895,\N,1,"Documentary,Short"

### Análise ficheiro 4: "title.crew.tsv"

In [56]:
con.sql(f"""
CREATE OR REPLACE TABLE imdb_title_crew AS
SELECT *
FROM read_csv_auto('{IMDB_DIR / "title.crew.tsv"}', delim='\t', header=TRUE)
""")

FloatProgress(value=0.0, layout=Layout(width='auto'), style=ProgressStyle(bar_color='black'))

In [57]:
con.sql("PRAGMA table_info('imdb_title_crew')").df()

   cid       name     type  notnull dflt_value     pk
0    0     tconst  VARCHAR    False       None  False
1    1  directors  VARCHAR    False       None  False
2    2    writers  VARCHAR    False       None  False

In [58]:
con.sql("SELECT * FROM imdb_title_crew LIMIT 10").df()

      tconst            directors    writers
0  tt0000001            nm0005690         \N
1  tt0000002            nm0721526         \N
2  tt0000003            nm0721526  nm0721526
3  tt0000004            nm0721526         \N
4  tt0000005            nm0005690         \N
5  tt0000006            nm0005690         \N
6  tt0000007  nm0005690,nm0374658         \N
7  tt0000008            nm0005690         \N
8  tt0000009            nm0085156  nm0085156
9  tt0000010            nm0525910         \N

### Análise ficheiro 5: "title.episode.tsv"

In [71]:
con.sql(f"""
CREATE OR REPLACE TABLE imdb_title_episode AS
SELECT *
FROM read_csv_auto('{IMDB_DIR / "title.episode.tsv"}', delim='\t', header=TRUE)
""")

In [60]:
con.sql("PRAGMA table_info('imdb_title_episode')").df()

   cid           name     type  notnull dflt_value     pk
0    0         tconst  VARCHAR    False       None  False
1    1   parentTconst  VARCHAR    False       None  False
2    2   seasonNumber  VARCHAR    False       None  False
3    3  episodeNumber  VARCHAR    False       None  False

In [72]:
con.sql("SELECT * FROM imdb_title_episode LIMIT 10").df()

      tconst parentTconst seasonNumber episodeNumber
0  tt0031458   tt32857063           \N            \N
1  tt0041951    tt0041038            1             9
2  tt0042816    tt0989125            1            17
3  tt0042889    tt0989125           \N            \N
4  tt0043426    tt0040051            3            42
5  tt0043631    tt0989125            2            16
6  tt0043693    tt0989125            2             8
7  tt0043710    tt0989125            3             3
8  tt0044093    tt0959862            1             6
9  tt0044668    tt0044243            2            16

### Análise ficheiro 6: "title.principals.tsv"

In [73]:
con.sql(f"""
CREATE OR REPLACE TABLE imdb_principals AS
SELECT *
FROM read_csv_auto('{IMDB_DIR / "title.principals.tsv"}', delim='\t', header=TRUE)
""")

FloatProgress(value=0.0, layout=Layout(width='auto'), style=ProgressStyle(bar_color='black'))

In [74]:
con.sql("PRAGMA table_info('imdb_principals')").df()

   cid        name     type  notnull dflt_value     pk
0    0      tconst  VARCHAR    False       None  False
1    1    ordering   BIGINT    False       None  False
2    2      nconst  VARCHAR    False       None  False
3    3    category  VARCHAR    False       None  False
4    4         job  VARCHAR    False       None  False
5    5  characters  VARCHAR    False       None  False

In [75]:
con.sql("SELECT * FROM imdb_principals LIMIT 10").df()

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Self""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0005690,producer,producer,\N
3,tt0000001,4,nm0374658,cinematographer,director of photography,\N
4,tt0000002,1,nm0721526,director,\N,\N
5,tt0000002,2,nm1335271,composer,\N,\N
6,tt0000003,1,nm0721526,director,\N,\N
7,tt0000003,2,nm0721526,writer,\N,\N
8,tt0000003,3,nm1770680,producer,producer,\N
9,tt0000003,4,nm0721526,producer,producer,\N

### Análise ficheiro 7: "title.ratings.tsv"

In [76]:
con.sql(f"""
CREATE OR REPLACE TABLE imdb_ratings AS
SELECT *
FROM read_csv_auto('{IMDB_DIR / "title.ratings.tsv"}', delim='\t', header=TRUE)
""")

In [77]:
con.sql("PRAGMA table_info('imdb_ratings')").df()

   cid           name     type  notnull dflt_value     pk
0    0         tconst  VARCHAR    False       None  False
1    1  averageRating   DOUBLE    False       None  False
2    2       numVotes   BIGINT    False       None  False

In [78]:
con.sql("SELECT * FROM imdb_ratings LIMIT 10").df()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2183
1  tt0000002            5.5       304
2  tt0000003            6.4      2263
3  tt0000004            5.2       195
4  tt0000005            6.2      3006
5  tt0000006            5.0       220
6  tt0000007            5.3       932
7  tt0000008            5.3      2355
8  tt0000009            5.3       231
9  tt0000010            6.8      8137

In [ ]:
SELECT
  movieId,
  'tt' || lpad(CAST(imdbId AS VARCHAR), 7, '0') AS tconst
FROM links
LIMIT 10;

IndentationError: unexpected indent (3373621621.py, line 2)

#### Fechar a ligação

In [79]:
con.close()
print("Ligação fechada.")

Ligação fechada.